{
  "Nav": {
    "aboutMe": "За нас",
    "blog": "Блог",
    "contacts": "Контакти",
    "events": "Събития",
    "enquiry": "Запитване",
    "services": "Услуги"
  },
  "Home": {
    "counselling": "Консултиране",
    "business": "Супервизия",
    "training": "Обучения"
  },
  "About": {
    "title": "За нас",
    "description": "Николина Ангелова, директор на Център Витус, е квалифициран психолог-консултант, с повече от 8 години клиничен опит. Подходът на Николина е интегративен - тя взаимства от различни психологически направления, за да осигури най-добрата и уникална грижа за всеки индивид.\n\nНиколина завършва магистърска програма по ”Детска и юношеска клинична психология” в Университета в Единбург, след което специализира “Интегративно психологическо консултиране”. Тя е член на Шотландската професионална организация за консултиране и психотерапия (COSCA) и квалифициран супервизор по консултиране от Ирландската асоциация за консултиране и психотерапия (IACP). Николина е и акредитиран обучител по консултиране и провежда обучения за професионалисти в помагащите професии.\n\nНиколина специализира в работата с деца и юноши, както и възрастни, преживели травма и загуба, минаващи през депресия, тревожности, хроничен стрес, с проблеми във взаимоотношенията и привързаността. Николина има специфичен интерес към работата с травматични преживявания и работа с миналото, който започна още през 2011г., докато учи \"Културна и социална антропология\" във Виенския университет. Тя преминава и едногодишен курс \"Въведение в психоанализата\". Проучванията показват, че креативните подходи в консултирането са изключително ефективни при себеопознаване и за справяне с травматични преживявания и преодоляване на кризи във взаимоотношенията и затова Николина обича да ги използва в работата си. Проучванията показват, че креативните подходи в консултирането са изключително ефективни при себеопознаване и за справяне с травматични преживявания и преодоляване на кризи във взаимоотношенията и затова Николина обича да ги използва в работата си."
  },
  "CounsellingServices": {
    "individualCounselling": {
      "title": "Индивидуално консултиране",
      "description": "*Център Витус* предлага индивидуално психологическо консултиране за всеки, който преминава през различни житейски кризи, като *загуба* на любим човек, *трудности във взаимоотношенията*, *скорошна или минала травма*, както и *депресия*, *тревожност*, *приступи на паника*, *хроничен стрес*, *ниско самочувствие*. Центърът специализира в работата с *тийнейждъри и младежи*. Индивидуалното консултиране също може да бъде полезно за тези, които са в *преходна точка в живота си*, като смяна на кариерата, създаване на семейство или ставане на родител."
    },
    "familyCounselling": {
      "title": "Семейно консултиране",
      "description": "Център Витус предлага семейно консултиране, което включва всички членове на семейството от основното семейство - родители и деца. Целта на семейното консултиране е да подобри взаимоотношенията и да разреши конфликтите в семейната структура, като работи с всички участници, а не с отделни клиенти, за да подобри комуникацията, да разреши конфликти и да подкрепи семейства, изправени пред предизвикателства."
    },
    "couplesCounselling": {
      "title": "Консултации за семейни двойки",
      "description": "Център Витус предлага консултации за семейни двойки с цел да им помогнат да разберат и разрешат конфликти по здравословен начин. Емоционално фокусираната терапия, която използваме при семейното консултиране, е с доказана ефективност и им дава на разположение инструменти за общуване с повече състрадание и по-малко страх. Тя спомага за това партньорите да се чувстват по-емоционално свързани и близки един с друг. "
    }
  },
  "Supervision": {
    "supervision": {
      "title": "Супервизия",
      "description": "Център Витус предоставя индивидуални и групови супервизии на професионалисти от помагащите професии- психолози, консултанти и социални работници с цел да ги подрепи чрез обсъждане на случаи от тяхната клинична практика. Супервизията подпомага отделния професионалист и/или екипа от професионалисти от една страна за по-добро разбиране и разпознаване на проблемните области на потребителя на услугата, а от друга страна изгражда устойчиво взаимодействие между професионалистите. Също така създава условия за осъзнаване на собственото поведение в професията и свързаните с него чувства, както и за предприемането на конкретни действия за позитивна промяна. \n\nЕкспертите в Център Витус са с дългогодишен опит във воденето на индивидуална и групова супервизия. Те са обучени да използват Цикличния модел на супервизия, разработен от Стийв Пейдж и Вал Уоскет, както и Процесния модел на супервизия, разработен от Питър Хоукинс и Робин Сонет."
    }
  },
  "Training": {
    "TrainingsForCPD": {
      "russianDolls": {
        "title": "Матрьошки в психологическото консултиране",
        "description": "В това практическо обучение за професионалисти ще научите как матрьошките могат да се използват като креативен подход в рамките на психологическото консултиране. Използването на матрьошки улеснява процеса на консултиране като помага на клиента чрез проекция да изследва и преодолее своите емоционални проблеми, произтичащи от минали травми и преживявания от детството, и по този начин да изгради по-цялостен и устойчив Аз-образ. "
      },
      "sandTrays": {
        "title": "Пясъчни сандъци в психологическото консултиране",
        "description": "Този семинар ще представи ползите от използването на пясъчни сандъци в психологическото консултиране. Работата с пясъчни сандъци може да повиши самосъзнанието на клиента и да насърчи изразяването, изследването и разрешаването на лични и междуличностни конфликти. Техниката помага на клиента да проектира чувствата си навън, позволява дистанциране от трудностите и помага на клиента да изрази несъзнателни чувства и мисли."
      },
      "clientsCreativity": {
        "title": "Освободете креативността на клиентите си",
        "description": "Този уъркшоп ще Ви покаже как можете да използвате креативни техники с Вашия клиент, за да задълбочите процеса на себепознание и себеизразяване, на разрешаване на личностни и междуличностни проблеми. Ще имате възможност да изградите увереността си в използването на голямо разнообразие от креативни интервенции в психологическото консултиране, които да подпомогнат процеса по навременен, подходящ и проницателен начин."
      }
    },
    "SeminarForCouples": {
      "couplesSeminar": {
        "title": "“Дръж ме здраво” - Семинар за двойки",
        "description": "Програмата има доказан ефект за подобряване на комуникацията и взаимоотношенията в двойките и помага за преодоляването на кризи и разделения в брачните отношения. Тя се базира на емоционално фокусираната терапия.\n\nПо-конкретно, тази програма е насочена към подпомагане на двойки да:\nоткрият и адресират негативната динамика, която води до чувство на откъснатост, нараняване и самота;\nразберат и изразят чувствата и нуждите си по начини, които ги доближават един до друг;\nзапочнат да поправят минали болки и наранявания;\nукрепят или възстановят доверието по между си;\nподновят силата на емоционалната си връзка;\nукрепят връзката чрез физическа привързаност и секс."
      }
    }
  },
  "ContactForm": {
    "landing": {
        "title": "Свържете се с нас",
        "description": "Ако искате да направите запитване за психологическа консултация, моля попълнете контактната форма с информация за вида консултиране, който Ви интересува и ние ще се свържем с Вас."
      },
      "supervision": {
        "title": "Свържете се с нас",
        "description": "Ако искате да направите запитване за индивидуална супервизия или супервизия на екип, моля попълнете контактната форма с по-подробна информация и ние ще се свържем с Вас."
      },
      "trainings": {
        "title": "Свържете се с нас",
        "description": "Ако искате да направите индивидуално запитване за едно от обученията, които предоставяме, или да заявите обучение за Вашия екип от професионалисти, моля попълнете контактната форма."
      },
      "name": "Име",
      "email": "Имейл",
      "message": "Съобщение",
      "submit": "Изпрати"
    },
    "Address": {
      "address": "булевард „Фритьоф Нансен“ 17, София, България"
    },
     "Contacts":{
      "contacts": "Контакти",
      "phone": "Телефон",
      "email": "Имейл",
      "address": "Адрес"
    }
  
} 
