{
  "Nav": {
    "aboutMe": "About",
    "blog": "Blog",
    "contacts": "Contacts",
    "events": "Events",
    "enquiry": "Contact us"
  },
  "Home": {
    "counselling": "Counselling",
    "business": "Supervision",
    "training": "Trainings"
  },
  "About": {
    "title": "About us",
    "description": "Nikolina Angelova, the Director of counselling Centre Vitus, is a qualified integrative counsellor with more than 8 years clinical experience. Nikolina’s approach is integrative - borrowing from different psychological disciplines to provide the best unique care for each individual.\n\n Nikolina completed her MSc in Child and Adolescent Clinical Psychology at the University of Edinburgh, after which she specialised in Integrative Counselling. She is a counsellor member of the Scotland's professional body for counselling and psychotherapy (COSCA) and a qualified counselling supervisor by the Irish Association for Counselling and Psychotherapy (IACP). Nikolina is also an accredited counselling trainer and provides trainings for professionals in the caring professions.\n\n Her work specialises in trauma and bereavement, children and adolescence, attachment, relationship issues, emotionally focused therapy and creativity. Nikolina has a specific interest in working with traumatic experiences and working with the past, which began back in 2011. While she was studying Cultural and Social Anthropology at the University in Vienna, she also did a one-year course 'Introduction to Psychoanalysis'. Nikolina likes to work with creative approaches in counselling, which she considers extremely effective for developing the client's potential, dealing with traumatic experiences and overcoming relationship crises."
  },
  "CounsellingServices": {
    "individualCounselling": {
      "title": "Individual Counselling",
      "description": "Centre Vitus offers individual counselling for those who want support – whether that’s with their relationships or something else entirely. The centre offers psychological counselling to individuals who are experiencing depression, anxiety, panic attacks, stress, loss of a loved one, low-self esteem or a recent or past trauma. Individual counselling can also be helpful for those who reach a milestone or transition point in their life, such as changing careers, starting a family or becoming a parent."
    },
    "familyCounselling": {
      "title": "Family Counselling",
      "description": "Centre Vitus offers family counselling, which includes all family members from a core family - parents and children. The aim of family counselling is to improve relationships and resolve conflicts within the family structure by working with all involved rather than individual clients to enhance communication, resolve conflict, and support families facing challenges."
    },
    "couplesCounselling": {
      "title": "Couples Counselling",
      "description": "Centre Vitus also offers couples counselling which can help them understand and resolve conflicts to improve their relationship. Couples counselling is intended to give couples the tools to communicate with more compassion and less fear while learning how to problem-solve and deal with conflict in a healthy manner. Based on the emotionally focused therapy, couples counselling can benefit couples who want to feel more emotionally connected and bonded with one another."
    }
  },
  "Supervision": {
    "supervision": {
      "title": "Supervision",
      "description": "Vitus Center provides individual and group supervision for professionals in the helping professions such as psychologists, counsellors, and social workers. Supervision aims to support practitioners through the discussion of cases from their clinical practice, both individually and in a team setting. The purpose of supervision is to assist the individual professional and-or the team of professionals in better understanding and recognising the problematic areas of the service user on one hand, and on the other hand, to build a sustainable interaction among the professionals. It also creates conditions for awareness of one's own behaviour in the profession and the associated feelings, as well as for taking specific actions for positive change.\n\nThe supervisors at Vitus Center have extensive experience in conducting individual and group supervision. They are trained to use the Cyclical model of supervision developed by Steve Page and Val Wosket, as well as the Process model of supervision developed by Peter Hawkins and Robin Shohet.\n\nCentre Vitus also offers couples counselling which can help them understand and resolve conflicts to improve their relationship. Couples counselling is intended to give couples the tools to communicate with more compassion and less fear while learning how to problem-solve and deal with conflict in a healthy manner. Based on the emotionally focused therapy, couples counselling can benefit couples who want to feel more emotionally connected and bonded with one another."
    }
  },

  "Training": {
    "TrainingsForCPD": {
      "russianDolls": {
        "title": "The Use of Russian Dolls in Counselling",
        "description": "There are so many ways of using Russian dolls in counselling. They have different layers, a bit like us - made up of the same person but at different ages and stages of our lives. During this experiential seminar, you will learn how Russian dolls can be used therapeutically within counselling to help clients of all ages explore and work through their emotional issues emerging from past trauma, childhood experiences, and build a more coherent self."
      },
      "sandTrays": {
        "title": "The Use of Sand Trays in Counselling",
        "description": "This workshop will introduce the benefits of using sand trays in counselling. Working with sand trays in counselling can powerfully enhance a client’s awareness of self and promoting expression, exploration, and resolution of personal and interpersonal conflicts. The technique helps clients project their feelings outwards, allows distance from the difficulties and helps the client express unconscious feelings and thoughts."
      },
      "clientsCreativity": {
        "title": "Unleash Your Clients’ Creativity",
        "description": "This workshop will introduce you to creative techniques and show you how to tailor these techniques for your clients in order to support them in self-awareness and self-exploration, resolution of personal and interpersonal issues. This workshop will give you the opportunity to build your confidence in using a wide variety of creative interventions to aid the client’s counselling process in timely, appropriate, and insightful ways."
      }
    },
    "SeminarForCouples": {
      "couplesSeminar": {
        "title": "“Hold me tight” - A seminar for couples",
        "description": "The program has a proven effect on improving couple’s communication and relationships and helping partners overcome crises and divisions in marital relations. It is based on emotionally focused therapy.\n\nMore specifically, this program is aimed at helping couples:\ndiscover and address negative dynamics that lead to feeling disconnected, hurt and alone.\nUnderstand and voice feelings and needs in ways that bring them closer to each other.\nBegin to repair past hurts and injuries.\nStrengthen or rebuild the trust between each other.\nRenew the strength of their emotional connection.\nStrengthen bonding through physical affection and sex."
      }
    }
  }
}
