{
  "Nav": {
    "aboutMe": "About",
    "blog": "Blog",
    "contacts": "Contacts",
    "events": "Events",
    "enquiry": "Contact us",
    "services": "Services"
  },
  "Home": {
    "counselling": "Counselling",
    "business": "Supervision",
    "training": "Trainings"
  },
  "About": {
    "title": "About us",
    "description": "Nikolina Angelova, the Director of counselling Vitus Centre, is a qualified integrative counsellor with more than 8 years clinical experience. Nikolina uses an integrative approach which combines different psychological techniques to provide the best unique care for each individual approach. \n\n Nikolina completed her MSc in Child and Adolescent Clinical Psychology at the University of Edinburgh, after which she specialised in Integrative Counselling. She is a counsellor member of the Scotland's professional body for counselling and psychotherapy (COSCA) and a qualified counselling supervisor by the Irish Association for Counselling and Psychotherapy (IACP). Nikolina is also an accredited counselling trainer and provides trainings for professionals in the caring professions.\n\n Her work specialises in trauma and bereavement, children and adolescence, attachment, relationship issues, emotionally focused therapy and creativity. Nikolina has a specific interest in working with traumatic experiences and working with the past, which began back in 2011. While she was studying Cultural and Social Anthropology at the University in Vienna, she also did a one-year course 'Introduction to Psychoanalysis'.  Research shows that creative approaches in counselling are extremely effective for self-exploration and in dealing with traumatic experiences and overcoming relationship crises.",
    "nadia": {
      "name": "Dr. Nadya Stoykova",
      "description": "Dr. Nadya Stoykova completed her doctoral program in social work and social pedagogy at Sofia University. She has been an honorary lecturer at the Academy of the Ministry of Interior since 2012, where she provides training to Ministry of Interior employees on child-friendly justice. She is the author of over 30 publications in the field of social work, violence prevention, and child justice. Nadya has extensive experience as a family counsellor, using emotionally focused therapy. Nadya is a psychological counselling trainer at Vitus Centre and a supervisor of teams in numerous social services for children and families in Bulgaria.\n\nShe works with children and adolescents, families and couples, specializing in working with people who have experienced trauma and violence, going through various life crises, anxiety, depression, and suicidal behavior."
    },
    "teamTitle": "Our counsellors under supervision",
    "team": [
     
      {
        "name": "Boryana Staneva",
        "description": "Boryana Staneva is a Bachelor and Master in Industrial Engineering. After 20+ years of experience in the IT sphere, due to a long-standing interest in psychology, relationships and working with people, she decided to retrain. In 2022, she completed a two-year course in \"Logotherapy and Existential Analysis\" at the Bulgarian Society for Logotherapy and Existential Analysis for a consultant-logotherapist. She is currently in her second year of training in \"Integrative Approach in Psychological Counselling\" at Vitus Centre. \nShe has an interest in working with adolescents and adults going through depression, existential crisis, relationship problems, identity problems, burnout.",
        "image": "Bo"
      },
      {
        "name": "Delyana Nikolova",
        "description": "Delyana Nikolova is currently in her second year of training in \"Integrative Approach in Psychological Counselling\" at Vitus Centre. She chose the path to psychology out of love for the human being – for their vulnerability, but also for their strength to change and grow. For her, the meeting between consultant and client is a space of trust and acceptance, in which together they can find direction, meaning and hope. Delyana believes that change happens step by step – with patience, trust and willingness to be heard and understood. She has undergone training in \"Emotionally Focused Therapy and Family Counselling\" and \"Introduction to Integrative Approach to Counselling\" at Vitus Centre. \nShe has an interest in working with adults, families and children on topics such as anxiety, low self-esteem, relationship difficulties, coping after separation, feeling of isolation, etc.",
        "image": "De"
      },
      {
        "name": "Aleksandra Yordanova",
        "description": "Aleksandra Yordanova is a Master in General Psychology at Sofia University and a Master in Sports Psychology at the University of Stirling, Scotland. She is currently in her second year of training in \"Integrative Approach in Psychological Counselling\" at Vitus Centre. She has counselling experience working with teenagers at risk, children with disabilities (Concordia Bulgaria), victims of human trafficking (at A21 Bulgaria), athletes.\nShe has an interest in working with teenagers and young people, working with traumatic experiences, as well as using sport as a means to improve mental health.",
        "image": "Al"
      },
      {
        "name": "Martina Radoslavova",
        "description": "Martina Radoslavova is a Bachelor in Social Activities at Sofia University. She is currently in her second year of training in \"Integrative Approach in Psychological Counselling\" at Vitus Centre. Martina believes that integrative psychotherapy skillfully combines different techniques so that the person is supported in the right way for them. As a therapist, her goal is to support the personality on its path to growth and self-actualization.\nShe has an interest in working with anxiety, trauma, relationship problems and self-esteem, as well as stress in the workplace.",
        "image": "Ma"
      },
      {
        "name": "Maria Angelova",
        "description": "Maria Angelova is currently in her second year of training in the \"Integrative Approach in Psychological Counselling\" program at Vitus Centre. Maria is also studying for a Bachelor's degree in Psychology at New Bulgarian University.\nMaria chose the path to counselling out of respect for human vulnerability and the strength that everyone carries within themselves. She believes that the essence of counselling is in creating a space in which a person can be seen, heard and understood – a place where trust, emotion and authenticity play a primary role.\nShe has an interest in working with adults and young people on topics related to anxiety, relationships and difficulties in them, as well as stress leading to burnout.",
        "image": "Maria"
      },
      {
        "name": "Ina Spasova",
        "description": "Ina Spasova gained diverse experience in the IT sphere, closely linked to working with people, before moving to the Netherlands, where she retrained. There she completed a Bachelor's degree in General Psychology and a Master's degree in Clinical Child and Adolescent Psychology at Leiden University. She is currently training in \"Integrative Approach in Psychological Counselling\" at Vitus Centre.\nIna believes that being different is neither something to strive for nor something to run away from. We are different from every other person in at least one thing and are like at least one other in everything. This makes people both unique and able to connect and recognize themselves in someone else. She likes nuances, apparent contradictions and unpopular perspectives.\nShe has an interest in working with both adults and young people, in the field of personal development, self-knowledge in a personal or professional context, loss of loved ones, anxiety, etc.",
        "image": "Ina"
      },
       {
        "name": "Teodora Trandeva - Avramova",
        "description": "Teodora Trandeva - Avramova is a Master in English Language in Primary Education and a Bachelor in Preschool and Primary School Pedagogy. She is currently studying for a second Master's degree in \"Mental Health for Children and Teenagers\" at the University of Edinburgh and a postgraduate qualification in \"Integrative Approach in Psychological Counselling\" at Vitus Centre. She has three years of experience in counselling children under the \"Close Person\" program, part of the Innovative Program for Mental Health and Support at Roerich Private School, Sofia. She has undergone training in \"Emotionally Focused Therapy and Family Counselling\" at Vitus Centre and \"Psychomotor Skills for Children\" at the German Institute for Psychomotor Skills for Children (certified psychomotor specialist, accredited by BAPM). \nShe has an interest in working with children, supporting pregnant women or those who have already given birth, as well as those who have suffered a loss. Currently, Teodora is on maternity leave until April 2026.",
        "image": "Te"
      }
    ]
  },
   "VitusInfo":{
    "title": "Vitus Centre",
    "description": "Vitus Centre offers individual and family counselling, as well as supervision and trainings for professionals from the helping professions. Our counsellors are trained in the integrative approach- they combine different psychological techniques, in order to provide the best and unique care for each individual. Vitus Centre partners with international organisations, such as ‘Vital Connexions’ (Scotland), ‘Care4You’ (The Netherlands), to exchange therapeutic and training experience. "
  },
  "Vision":{
    "title": "Our Vision",
    "description": "We believe that every person is valuable and has a unique contribution to the welfare of society. Therefore, one of our main goals is to support each individual to overcome and to cope with life crises and difficulties, as well as traumatic experiences, and develop psychological resilience, in order to reach their full potential.\n\nWe chose the tree as a metaphor for humans, which if planted by streams of water (safe and supporting environment), will yield its fruit in season, its leaves will not wither, and in all that it does, it will prosper."
  },
  "CounsellingServices": {
    "individualCounselling": {
      "title": "Individual Counselling",
      "description": "Vitus Centre offers individual counselling for everyone who is going through a life crisis, such as:\n\n- loss of a loved one;\n\n- relationship difficulties;\n\n- recent or past trauma;\n\n- depression;\n\n- anxiety and panic attacks;\n\n- chronic stress;\n\n- low self-esteem;\n\n- career change;\n\n- starting a family;\n\n- parenting.\n\nVitus Centre specialises in the work with children and teenagers."    },
    "familyCounselling": {
      "title": "Family Counselling",
      "description": "Vitus Centre offers family counselling, which includes all family members from a core family - parents and children. The aim of family counselling is to improve relationships and resolve conflicts within the family structure by working with all involved rather than individual clients to enhance communication, resolve conflict, and support families facing challenges."
    },
    "couplesCounselling": {
      "title": "Couples Counselling",
      "description": "Vitus Centre offers counselling for couples to help them understand and resolve conflicts in a healthy way. The emotionally focused therapy we use in couples counselling is evidence-based and equips each partner with tools to communicate with more empathy and less fear. It aids couples in feeling more emotionally connected and bonded with one another."
    }
  },
  "Supervision": {
    "supervision": {
      "title": "Supervision",
      "description": "Vitus Centre offers individual and group supervision to professionals in the supporting professions such as psychologists, counsellors, and social workers. Supervision aims to support practitioners through the discussion of cases from their clinical practice. Supervision assists the individual professional and/or the team of professionals, on the one hand, in better understanding and recognising problematic areas in service users  and, on the other, in building a sustainable interaction among the professionals. In addition, it creates conditions for awareness of one's own behaviour in the profession and the associated feelings, as well as inspires motivation for positive change.\n\nThe experts at Vitus Centre have extensive experience in conducting individual and group supervision. They are trained to use the Cyclical model of supervision developed by Steve Page and Val Wosket, as well as the Process model of supervision developed by Peter Hawkins and Robin Shohet."
    }
  },

  "Training": {
    "TrainingsForCPD": {
      "russianDolls": {
        "title": "The Use of Russian Dolls in Counselling",
        "description": "In this practical training for professionals you will learn how to use Russian dolls as a creative approach in counselling. Using Russian dolls in counselling facilitates the counselling process by helping the client through projection to explore and overcome their emotional problems, stemming from past traumas and childhood experiences, and as a result to build a more holistic and sustainable self-image."
      },
      "sandTrays": {
        "title": "The Use of Sand Trays in Counselling",
        "description": "This training for professionals introduces different techniques and the benefits of using sand trays in counselling. Working with sand trays in counselling can powerfully enhance a client’s awareness of self and promote expression, exploration, and resolution of personal and interpersonal conflicts. The training is suitable for counsellors and social workers who would like to diversify and enrich their therapeutic approach."
      },
      "clientsCreativity": {
        "title": "Unleash Your Clients’ Creativity",
        "description": "This training provides an opportunity for professionals to experiment with a wide variety of creative approaches and to gain confidence in using them in counselling and social work.  The application of creative approaches in counselling has proven effective in helping the client resolve personal and interpersonal problems, express and know themselves better, and in deepening or focusing the therapeutic process."
      }
    },
    "SeminarForCouples": {
      "couplesSeminar": {
        "title": "“Hold me tight” - A seminar for couples",
        "description": "“Hold me tight” is an evidence-based programme, effective in improving couples' communication and relationships, and helping partners overcome crises and divisions in marital relations. It is based on emotionally focused therapy. More specifically, this program is aimed at helping couples:\n\n- discover and address negative dynamics that lead to feeling disconnected, hurt, and alone;\n\n- understand and voice feelings and needs in ways that bring them closer to each other;\n\n- begin to repair past hurts and injuries;\n\n- strengthen or rebuild the trust between each other;\n\n- renew the strength of their emotional connection;\n\n- and strengthen bonding through physical affection and sex."
     }
    },
      "parentsSeminar": {
        "title": "Healthy Relationships Between Parents and Teenagers",
        "description": "The training aims to help parents build close relationships with their growing teenagers. The training helps parents to:\n\n- understand the basic stages of adolescent development;\n\n- understand the teenagers’ drive towards separation from their parents, and how this can happen in a healthy way, in order to maintain the parent-child relationship during the turbulent transition period;\n\n- develop skills to understand and communicate with their children during conflicts and disagreements, as well as special skills for reconciliation and forgiveness after conflict and hurt;\n\n- understand the emotional reactions and behaviour of teenagers in times of crisis and how to stand by them as significant adults.\n\nTowards the end of the training, a joint meeting with the teenagers is organised to help them understand their parents' reactions and to open up to reconciliation after conflict and hurt. "
      }
  },
    "ContactForm": {
   "landing": {
      "title": "Contact Us",
      "description": "If you would like to make an inquiry about a counselling session, please fill out the contact form and we will contact you."
    },
    "supervision": {
      "title": "Contact Us",
      "description": "If you would like to inquire about individual supervision or team supervision, please fill out the contact form with more detailed information and we will contact you."
    },
    "trainings": {
      "title": "Contact Us",
      "description": "If you would like to make an individual inquiry about one of the trainings we provide, or request training for your team of professionals, please fill out the contact form."
    },
      "contacts": {
      "title": "Contact Us",
      "description": "If you would like to make an inquiry about a counselling session, please fill out the contact form and we will contact you."
    },
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "submit": "Submit"
    },
    "Address": {
      "address": "Fridtjof Nansen 17, Sofia, Bulgaria"
    },
    "Contacts":{
      "contacts": "Contacts",
      "phone": "Phone",
      "email": "Email",
      "address": "Address"
    }
    
}
